##mutolisp自製R課程-R的數學運算及邏輯判斷
##練習
#第四題-Shannon Diversity Index
P <- c(5,15,1,2,1,10,3,20,12,7,3)
s <- sum (P)
p <- c(5,15,1,2,1,10,3,20,12,7,3)/s
A1 <- -(sum (p * log (p)))



Q <- c(1,5,6,19,14,13,12,10,5,3,6,7,9,10,11,12,1,1,1)
t <- sum (Q)
q <- c(1,5,6,19,14,13,12,10,5,3,6,7,9,10,11,12,1,1,1)/t
A2 <- -(sum (q * log (q)))


#第五題-Jaccard Similarity Index
X1 <- length(c(1,5,6,19,14,13,12,10,5,3,6,7,9,10,11,12,1,1,1))
X2 <- length(c(5,15,1,2,1,10,3,20,12,7,3))
2/(X1+X2)

##第五題延伸
#尋找數列的元素及其個數
summary (as.factor(x))

#單純尋找數列有哪些元素
unique (x)
