#矩陣運算
#矩陣相乘=>積(dot) => %*%
# 在 R 內產生矩陣的方式為 matrix(data, nrow, ncol)
# data 是這個矩陣的數值, nrow 表示有幾列(橫的), ncol 是幾欄(行)(直的)
#i=col;j=row;a(i,j)
# 預設會從第一欄第一列依序照欄排列數字，如果要按照列排列數字，
# 則參數為 byrow=T} ( 未特別設定時 byrow=F)
#byrow為數字放置的順序，
#byrow=T，指的是數字按順序從第一行左至右放入，放完再放第二行
#byrow=F，指的是數字按順序從第一列上至下放入，放完再放第二列
#ex:A <- matrix (c(1,2,3,4,5,6,7,8,9),3,3, byrow=T)
A <- matrix (c(1,2,3,4,5,6,7,8,9),3,3, byrow=T)
A
#ex:B <- matrix (c(1,2,3,4,5,6,7,8,9),3,3, byrow=F)
B <- matrix (c(1,2,3,4,5,6,7,8,9),3,3, byrow=F)
B
#A dot B
A %*% B

#A * B (元素相乘)
A * B

C <- matrix (c(1,-1,0,3,2,1),2,3)
D <- matrix (c(3,2,1,1,1,0),3,2)
C %*% D
#C %*% D => 
#a(1,1)=(C(1,1)*D(1,1)=1*3)+(C(1,2)*D(2,1)=0*2)+(C(1,3)*D(3,1)=2*1)=5
#a(1,2)=(C(1,1)*D(1,2)=1*1)+(C(1,2)*D(2,2)=0*1)+(C(1,3)*D(3,2)=2*0)=1
#a(2,1)=(C(2,1)*D(1,1)=-1*3)+(C(2,2)*D(2,1)=3*2)+(C(2,3)*D(3,1)=1*1)=4
#a(2,2)=(C(2,1)*D(1,2)=-1*1)+(C(2,2)*D(2,2)=3*1)+(C(2,3)*D(3,2)=1*0)=2

#轉置矩陣
E <- t(A)
F <- t(C)
#其他數學運算語法
?plotmath




