load("/Users/lucy/Desktop/R 練習/1012_pr.rdata")
##row：列(橫的)；col：欄(行)(直的)
#建立成資料框架
m10.df <- data.frame (m10)

#轉換成資料框架
m10.df2 <- as.data.frame (m10)

#把 m10.df 第五行（欄；column）到第十行另外存成一個 R 的 data.frame 物件（object，在此即為變數）
m10_5_10.df <- data.frame ( m10 [,5:10])
pi * (m10 [,3] * m10 [,4])

#行(欄)位加總(即：第一行＋第二行＋第三行＋…＋第十行)
rowSums (m10) 

#列位加總(即：第一列＋第二列＋第三列＋…＋第十列)
colSums (m10)
x <- c('DG01','印度牛膝',5,'DG01','大花咸豐草',15,'DG01','烏面馬',1,'DG01','短穎馬唐',2,'DG01','綠珊瑚',1,'DG01','酢漿草',10,'DG01','野莧菜',3,'DG01','銀合歡',20,'DG01','馬櫻丹',12,'DG01','龍爪茅',7,'DG01','龍葵',3,'DG02','光果黃細心',1,'DG02','台灣灰毛豆',5,'DG02','土丁桂',6,'DG02','大花咸豐草',19,'DG02','大飛揚草',14,'DG02','孟仁草',13,'DG02','毛馬齒莧',12,'DG02','煉莢豆',10,'DG02','獨行菜',5,'DG02','白花牽牛',3,'DG02','紅花黃細心',6,'DG02','臭濱芥',7,'DG02','草梧桐',9,'DG02','酢漿草',10,'DG02','雙花草',11,'DG02','雞觴刺',12,'DG02','香茹',1,'DG02','香附子',1,'DG02','鬼針',1)
x.m <- matrix ( x, ncol = 3, byrow = T, dimnames = list (c(),c('樣區id','物種','株數')))

##設定欄位名：matrix()中最後面加上dimnames = NULL (NULL = list (vrow (矩陣右側的每一列位名), vcol (矩陣上方的每一欄位名)))
pgplot <- data.frame (x.m)


#另一種做法：將網站表格資料輸進excel中轉成csv檔後，讀入Ｒ中，即成為一矩陣資料，自動設定好欄位名
data <- read.csv ("/Users/lucy/Desktop/R 練習/資料結構作業-調查資料表格.csv")
pgplot2 <- data.frame (data)

##查詢工作目錄設定位置
getwd ()

##設定工作目錄位置
setwd ()





